package my.home.jonline.module01.loop;

/*
 * 6. Вывести на экран соответствий между символами и их численными обозначениями в памяти компьютера
 * 
 */

public class Task06 {

	public static void main(String[] args) {
		for (int i = 0; i <= 127; i++) {
			System.out.println((char) i);
		}

	}

}
